// Вивести на сторінку в один рядок через кому числа від 10 до 20.
let stringNum = "";
for (let i = 10; i <= 20; i++) {
    stringNum += i;
    if (i < 20) {
        stringNum += ", ";
    }
}
console.log(stringNum);

// Вивести квадрати чисел від 10 до 20.
let stringSquareNum = "";
for (let i = 10; i <= 20; i++) {
    stringSquareNum += i * i;
    if (i < 20) {
        stringSquareNum += ", ";
    }
}
console.log(stringSquareNum);

// Вивести таблицю множення на 7.
let stringMulTable7 = "";
for (let i = 1; i <= 10; i++) {
    stringMulTable7 += "7*" + i + "=" + 7 * i;
    if (i < 20) {
        stringMulTable7 += ", ";
    }
}
console.log(stringMulTable7);
// Знайти суму всіх цілих чисел від 1 до 15.


// Знайти добуток усіх цілих чисел від 15 до 35.
// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників.
// Знайти суму його парних дільників.
// Надрукувати повну таблицю множення від 1 до 10.